In [ ]:
import pandas as pd 
import numpy as np

# uS,^L'wTSz!9RTN

In [3]:
series = pd.Series(data = [78, 92, 36, 64, 89])  
series

0    78
1    92
2    36
3    64
4    89
dtype: int64

In [8]:
print(series.values)
series[1:3]

[78 92 36 64 89]

1    92
2    36
dtype: int64

In [10]:
# data = pd.Series(data =[700000, 800000, 250000, 560000, 100000], index=["A", "B", "C", "D", "E"])
data = pd.Series(data = [700000, 800000, 1600000, 1800000, 30000000], index = ['Swift', 'Jazz', 'Civic', 'Altis', 'Gallardo'])
data

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64

In [12]:
#Using dictionary to create a series
car_price_dict = {'Swift':  700000,
                       'Jazz' :  800000,
                       'Civic' : 1600000,
                       'Altis' : 1800000,
                       'Gallardo': 30000000
                      }

# what we did here is that we first crewated a dictionary and than we passed it to the pd.series function
car_price = pd.Series(car_price_dict)
car_price

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64

In [18]:

df = pd.read_csv("./nutri.csv")
df

,gender,situation,tea,coffee,height,weight,age,meat,fish,raw_fruit,cooked_fruit_veg,chocol,fat
0,Female,1,0,0,151.0,58,72,4,3,1,4,5,6
1,Female,1,1,1,162.0,60,68,5,2,5,5,1,4
2,Female,1,0,4,162.0,75,78,3,1,5,2,5,4
3,Female,1,0,0,154.0,45,91,0,4,4,0,3,2
4,Female,1,2,1,154.0,50,65,5,3,5,5,3,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
221,Female,1,0,1,160.0,73,74,4,3,5,5,1,6
222,Female,2,0,3,163.0,62,68,4,3,4,4,1,3
223,Male,2,0,2,170.0,74,71,4,3,4,4,1,3
224,Female,1,0,2,154.0,45,77,4,3,3,5,3,5
225,Female,2,2,0,159.0,63,69,3,3,5,5,1,4

In [19]:
df_head = df.head()

In [24]:
# df_head = df_head.set_index()
# Syntax - df.iloc[Rows, Columns]
df.iloc[1:7, 4:8]

   height  weight  age  meat
1   162.0      60   68     5
2   162.0      75   78     3
3   154.0      45   91     0
4   154.0      50   65     5
5   159.0      66   82     4
6   160.0      66   74     3

In [25]:
marks = {'Chemistry': [67,90,66,32], 
        'Physics': [45,92,72,40],  
        'Mathematics': [50,87,81,12],  
        'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [26]:
marks_df['Total'] = marks_df['Chemistry'] + marks_df['Physics'] + marks_df['Mathematics'] + marks_df['English']
marks_df

        Chemistry  Physics  Mathematics  English  Total
Subodh         67       45           50       19    181
Ram            90       92           87       90    359
Abdul          66       72           81       72    291
John           32       40           12       68    152

In [27]:
marks_df.drop(columns = 'Total', inplace = True)

In [28]:
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [29]:
marks = [{'Chemistry': 67, 'Physics': 45, 'Mathematics': 50, 'English' : 19},
        {'Chemistry': 90, 'Physics': 92, 'Mathematics': 87, 'English' : 90}, 
        {'Chemistry': 66, 'Physics': 72, 'Mathematics': 81, 'English' : 72}, 
        {'Chemistry': 32, 'Physics': 40, 'Mathematics': 12, 'English' : 68}]
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [30]:
f = marks_df < 33
marks_df.mask(f, 'fail')

       Chemistry  Physics Mathematics English
Subodh        67       45          50    fail
Ram           90       92          87      90
Abdul         66       72          81      72
John        fail       40        fail      68

In [31]:
marks = {'Chemistry': [67,90,66,32], 
        'Physics': [45,92,72,40],  
        'Mathematics': [50,87,81,12],  
        'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

In [32]:
#encrypting marks as sine of marks
encrypted_marks = np.sin(marks_df)
encrypted_marks

        Chemistry   Physics  Mathematics   English
Subodh  -0.855520  0.850904    -0.262375  0.149877
Ram      0.893997 -0.779466    -0.821818  0.893997
Abdul   -0.026551  0.253823    -0.629888  0.253823
John     0.551427  0.745113    -0.536573 -0.897928

In [33]:
encrypted_marks.reset_index(inplace = True)
encrypted_marks

    index  Chemistry   Physics  Mathematics   English
0  Subodh  -0.855520  0.850904    -0.262375  0.149877
1     Ram   0.893997 -0.779466    -0.821818  0.893997
2   Abdul  -0.026551  0.253823    -0.629888  0.253823
3    John   0.551427  0.745113    -0.536573 -0.897928

In [34]:
df1 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1,df2)

    employee        group
0      Jyoti   Accounting
1      Sapna  Engineering
2        Raj  Engineering
3  Ramaswamy           HR

    employee  hire_date
0      Jyoti       2004
1      Sapna       2008
2        Raj       2012
3  Ramaswamy       2014

In [35]:
df = pd.merge(df1, df2)

In [36]:
df

    employee        group  hire_date
0      Jyoti   Accounting       2004
1      Sapna  Engineering       2008
2        Raj  Engineering       2012
3  Ramaswamy           HR       2014

In [ ]:
pd.read

In [39]:
rng = np.array(list(range(10,20)))

ser = pd.Series(rng)

ser+=10

print(ser.iloc[7])

27

In [40]:
import pandas as pd

ser = pd.Series([10,20,30,40,50], index = [1,2,3,4,5])

print(ser.iloc[1])

20